# ActualValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageType..::..ActualValue Property
VoltageType Class See Also
---
Get actual voltage value of this voltage definition, the unit is volt.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ActualValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActualValue As Double
	Get
```

Visual C++
---
```text
public:
property double ActualValue {
	double get ();
}
```

# See Also
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace